# ForwardIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSet..::..ForwardIterator Method
ViewSet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ViewSetIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As ViewSetIterator
```

Visual C++
---
```text
public:
virtual ViewSetIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# See Also
ViewSet Class
Autodesk.Revit.DB Namespace